d-ronin/dRonin/flight/PiOS/STM32/pios_servo.c
/**
 ******************************************************************************
 * @addtogroup PIOS PIOS Core hardware abstraction layer
 * @{
 * @addtogroup   PIOS_SERVO RC Servo Functions
 * @brief Code to do set RC servo output
 * @{
 *
 * @file       pios_servo.c
 * @author     The OpenPilot Team, http://www.openpilot.org Copyright (C) 2012.
 * @author     Tau Labs, http://taulabs.org, Copyright (C) 2014-2015
 * @author     dRonin, http://dRonin.org, Copyright (C) 2016
 * @brief      RC Servo routines (STM32 dependent)
 * @see        The GNU Public License (GPL) Version 3
 *
 *****************************************************************************/
/*
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 * or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
 * for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>
 *
 * Additional note on redistribution: The copyright and license notices above
 * must be maintained in each individual source file that is a derivative work
 * of this source file; otherwise redistribution is prohibited.
 */

/* Project Includes */
#include "pios.h"
#include "pios_servo_priv.h"
#include "pios_tim_priv.h"

#ifndef STM32F0XX	// No high-res delay on F0 yet
#include "pios_inlinedelay.h"
#include "pios_irq.h"
#endif

#if defined(PIOS_INCLUDE_DMASHOT)
#include "pios_dmashot.h"
#endif

#include "misc_math.h"

/* Private variables */
static const struct pios_servo_cfg *servo_cfg;

//! The counter rate for the channel, used to calculate compare values.

enum dshot_gpio {
	DS_GPIOA = 0,
	DS_GPIOB,
	DS_GPIOC,
	DS_GPIO_NUMVALS
} __attribute__((packed));

enum channel_mode {
	UNCONFIGURED = 0,
	REGULAR_PWM,
	REGULAR_INVERTED_PWM,
	SYNC_PWM,
	SYNC_DSHOT_300,
	SYNC_DSHOT_600,
	SYNC_DSHOT_1200,
	SYNC_DSHOT_DMA
} __attribute__((packed));

struct dshot_info {
	uint16_t value;
	uint16_t pin;
	enum dshot_gpio gpio;
};

struct output_channel {
	enum channel_mode mode;

	union {
		uint32_t pwm_res;
		struct dshot_info dshot;
	} i;
} __attribute__((packed));

static struct output_channel *output_channels;

static uintptr_t servo_tim_id;

static bool resetting;

static bool dshot_in_use;

/* Private function prototypes */
static uint32_t timer_apb_clock(TIM_TypeDef *timer);
static uint32_t max_timer_clock(TIM_TypeDef *timer);

/**
* Initialise Servos
*/
int32_t PIOS_Servo_Init(const struct pios_servo_cfg *cfg)
{
	PIOS_Assert(!servo_tim_id);		// Make sure not inited already

	if (PIOS_TIM_InitChannels(&servo_tim_id, cfg->channels, cfg->num_channels, NULL, 0)) {
		return -1;
	}

	/* Store away the requested configuration */
	servo_cfg = cfg;

	/* Configure the channels to be in output compare mode */
	for (uint8_t i = 0; i < cfg->num_channels; i++) {
		const struct pios_tim_channel *chan = &cfg->channels[i];

		/* Set up for output compare function */
		switch(chan->timer_chan) {
			case TIM_Channel_1:
				TIM_OC1Init(chan->timer, (TIM_OCInitTypeDef *)&cfg->tim_oc_init);
				TIM_OC1PreloadConfig(chan->timer, TIM_OCPreload_Enable);
				break;
			case TIM_Channel_2:
				TIM_OC2Init(chan->timer, (TIM_OCInitTypeDef *)&cfg->tim_oc_init);
				TIM_OC2PreloadConfig(chan->timer, TIM_OCPreload_Enable);
				break;
			case TIM_Channel_3:
				TIM_OC3Init(chan->timer, (TIM_OCInitTypeDef *)&cfg->tim_oc_init);
				TIM_OC3PreloadConfig(chan->timer, TIM_OCPreload_Enable);
				break;
			case TIM_Channel_4:
				TIM_OC4Init(chan->timer, (TIM_OCInitTypeDef *)&cfg->tim_oc_init);
				TIM_OC4PreloadConfig(chan->timer, TIM_OCPreload_Enable);
				break;
		}

		TIM_ARRPreloadConfig(chan->timer, ENABLE);
		TIM_CtrlPWMOutputs(chan->timer, ENABLE);
		TIM_Cmd(chan->timer, ENABLE);
	}

	output_channels = PIOS_malloc(servo_cfg->num_channels * sizeof(*output_channels));
	if (output_channels == NULL) {
		return -1;
	}
	memset(output_channels, 0, servo_cfg->num_channels * sizeof(*output_channels));

	return 0;
}

struct timer_bank {
	TIM_TypeDef *timer;
	uint32_t clk_rate;
	uint16_t max_pulse;
	uint16_t prescaler;
	uint16_t period;
};

static void ChannelSetup_DShot(int j, uint16_t rate)
{
	switch (rate) {
		case SHOT_DSHOT300:
			output_channels[j].mode = SYNC_DSHOT_300;
			break;
		case SHOT_DSHOT600:
			output_channels[j].mode = SYNC_DSHOT_600;
			break;
		case SHOT_DSHOT1200:
			output_channels[j].mode = SYNC_DSHOT_1200;
			break;
		default:
			PIOS_Assert(false);
	};

	struct dshot_info *ds_info = &output_channels[j].i.dshot;

	ds_info->value = 0;

	switch ((uintptr_t) servo_cfg->channels[j].pin.gpio) {
		case (uintptr_t) GPIOA:
			ds_info->gpio = DS_GPIOA;
			break;
		case (uintptr_t) GPIOB:
			ds_info->gpio = DS_GPIOB;
			break;
		case (uintptr_t) GPIOC:
			ds_info->gpio = DS_GPIOC;
			break;
		default:
			PIOS_Assert(false);
	}

	ds_info->pin = servo_cfg->channels[j].pin.init.GPIO_Pin;
}

static int BankSetup_DShot(struct timer_bank *bank)
{
	/*
	 * Relatively simple configuration here.  Just seize it!
	 */
	PIOS_TIM_SetBankToGPOut(servo_tim_id, bank->timer);

	return 0;
}

static int BankSetup_OneShot(struct timer_bank *bank, int32_t max_tim_clock)
{
	/* 
	 * Ensure a dead time of 2% + 10 us, e.g. 15us for 250us
	 * long pulses, 50 us for 2000us long pulses
	 */
	float period = 1.02f * bank->max_pulse + 10.0f;
	float num_ticks = period / 1e6f * max_tim_clock;
	// assume 16-bit timer
	bank->prescaler = num_ticks / 0xffff + 0.5f;
	bank->clk_rate = max_tim_clock / (bank->prescaler + 1);
	bank->period = period / 1e6f * bank->clk_rate;

	// select one pulse mode for SyncPWM
	TIM_SelectOnePulseMode(bank->timer, TIM_OPMode_Single);
	// Need to invert output polarity for one-pulse mode
	uint16_t inverted_polarity = (servo_cfg->tim_oc_init.TIM_OCPolarity == TIM_OCPolarity_Low) ?
		TIM_OCPolarity_High : TIM_OCPolarity_Low;
	TIM_OC1PolarityConfig(bank->timer, inverted_polarity);
	TIM_OC2PolarityConfig(bank->timer, inverted_polarity);
	TIM_OC3PolarityConfig(bank->timer, inverted_polarity);
	TIM_OC4PolarityConfig(bank->timer, inverted_polarity);

