d-ronin/dRonin/flight/PiOS/STM32/pios_servo.c
	return 0;
}

static int BankSetup_PWM(struct timer_bank *bank, int32_t max_tim_clock,
		uint16_t rate)
{
	// assume 16-bit timer
	if (servo_cfg->force_1MHz) {
		bank->prescaler = max_tim_clock / 1000000 - 1;
	} else {
		float num_ticks = (float)max_tim_clock / (float)rate;

		bank->prescaler = num_ticks / 0xffff + 0.5f;
	}

	bank->clk_rate = max_tim_clock / (bank->prescaler + 1);
	bank->period = (float)bank->clk_rate / (float)rate;

	// de-select one pulse mode in case SyncPWM was previously used
	TIM_SelectOnePulseMode(bank->timer, TIM_OPMode_Repetitive);

	// and make sure the output is enabled
	TIM_Cmd(bank->timer, ENABLE);

	// restore polarity in case one-pulse was used
	TIM_OC1PolarityConfig(bank->timer, servo_cfg->tim_oc_init.TIM_OCPolarity);
	TIM_OC2PolarityConfig(bank->timer, servo_cfg->tim_oc_init.TIM_OCPolarity);
	TIM_OC3PolarityConfig(bank->timer, servo_cfg->tim_oc_init.TIM_OCPolarity);
	TIM_OC4PolarityConfig(bank->timer, servo_cfg->tim_oc_init.TIM_OCPolarity);

	return 0;
}

/**
 * @brief PIOS_Servo_SetMode Sets the PWM output frequency and resolution.
 * An output rate of 0 indicates Synchronous updates (e.g. SyncPWM/OneShot), otherwise
 * normal PWM at the specified output rate. SyncPWM uses hardware one-pulse mode.
 * Timer prescaler and related parameters are calculated based on the channel
 * with highest max pulse length on each timer. A deadtime is provided to
 * ensure SyncPWM pulses cannot merge.
 * The information required to convert from us to compare value is cached
 * for each channel (not timer) to facilitate PIOS_Servo_Set
 * @param out_rate array of output rate in Hz, banks elements
 * @param banks maximum number of banks
 * @param channel_max array of max pulse lengths, number of channels elements
 */
int PIOS_Servo_SetMode(const uint16_t *out_rate, const int banks, const uint16_t *channel_max, const uint16_t *channel_min)
{
	if (!servo_cfg || banks > PIOS_SERVO_MAX_BANKS) {
		return -10;
	}

#if defined(PIOS_INCLUDE_DMASHOT)
	if (PIOS_DMAShot_IsConfigured()){
		PIOS_DMAShot_Prepare();
	}
#endif

	dshot_in_use = false;

	struct timer_bank timer_banks[PIOS_SERVO_MAX_BANKS];

	PIOS_TIM_InitAllTimerPins(servo_tim_id);

	memset(&timer_banks, 0, sizeof(timer_banks));
	int banks_found = 0;

	// find max pulse length for each bank
	for (int i = 0; i < servo_cfg->num_channels && banks_found < banks; i++) {
		int bank = -1;
		const struct pios_tim_channel *chan = &servo_cfg->channels[i];
		for (int j = 0; j < banks_found; j++) {
			if (timer_banks[j].timer == chan->timer)
				bank = j;
		}

		if (bank < 0)
			bank = banks_found++;

		timer_banks[bank].timer = chan->timer;
		timer_banks[bank].max_pulse = MAX(timer_banks[bank].max_pulse, channel_max[i]);
		timer_banks[bank].max_pulse = MAX(timer_banks[bank].max_pulse, channel_min[i]);
	}

	// configure timers/banks
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure = servo_cfg->tim_base_init;
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
	for (int i = 0; i < banks_found; i++) {
		// Skip the bank if no outputs are configured
		if (timer_banks[i].max_pulse == 0)
			continue;

		/* Calculate the maximum clock frequency for the timer */
		uint32_t max_tim_clock = max_timer_clock(timer_banks[i].timer);
		// check if valid timer
		if (!max_tim_clock) {
			return -20;
		}

		uint16_t rate = out_rate[i];

		if (servo_cfg->force_1MHz && (rate == SHOT_ONESHOT)) {
			/* We've been asked for syncPWM but are in a config
			 * where we can't do it.  This means CC3D + 333Hz.
			 * Getting fast output is functionally identical
			 * to oneshot on a target like this.  Pick a period
			 * that has a lot of deadtime and call it good.
			 */

			/* Works out to 2500Hz at normal 250us max pulse,
			 * 400Hz at 2000us.
			 *
			 * Put one more way, with "oneshot", 400us of variable
			 * delay on 3300us control period.
			 */

			rate = 1000000 / (timer_banks[i].max_pulse +
					timer_banks[i].max_pulse / 5 +
					100);
		}

		int ret;

		// output rate of 0 means SyncPWM
		switch (rate) {
		case SHOT_ONESHOT:
			ret = BankSetup_OneShot(&timer_banks[i], max_tim_clock);

			if (ret) {
				return ret;
			}

			TIM_TimeBaseStructure.TIM_Prescaler = timer_banks[i].prescaler;
			TIM_TimeBaseStructure.TIM_Period = timer_banks[i].period;

			// Configure this timer appropriately.
			TIM_TimeBaseInit(timer_banks[i].timer, &TIM_TimeBaseStructure);
			break;

		default:
			ret = BankSetup_PWM(&timer_banks[i], max_tim_clock, rate);

			if (ret) {
				return ret;
			}

			TIM_TimeBaseStructure.TIM_Prescaler = timer_banks[i].prescaler;
			TIM_TimeBaseStructure.TIM_Period = timer_banks[i].period;

			// Configure this timer appropriately.
			TIM_TimeBaseInit(timer_banks[i].timer, &TIM_TimeBaseStructure);
			break;

		case SHOT_DSHOT300:
		case SHOT_DSHOT600:
		case SHOT_DSHOT1200:
			ret = 1;
#if defined(PIOS_INCLUDE_DMASHOT)
			if (PIOS_DMAShot_IsConfigured()) {
				uint32_t freq = rate == SHOT_DSHOT1200 ? DMASHOT_1200 : rate == SHOT_DSHOT600 ? DMASHOT_600 : DMASHOT_300;
				ret = PIOS_DMAShot_RegisterTimer(timer_banks[i].timer, max_tim_clock, freq) ? 0 : 1;
			}
#endif
			if (ret) {
				dshot_in_use = true;

				ret = BankSetup_DShot(&timer_banks[i]);
			}
			if (ret) {
				return ret;
			}
			break;
		}


		/* Configure frequency scaler for all channels that use the same timer */
		for (uint8_t j = 0; j < servo_cfg->num_channels; j++) {
			const struct pios_tim_channel *chan = &servo_cfg->channels[j];
			if (timer_banks[i].timer == chan->timer) {
				/* save the frequency for these channels */
				switch (rate) {
				case SHOT_DSHOT300:
				case SHOT_DSHOT600:
				case SHOT_DSHOT1200:
#if defined(PIOS_INCLUDE_DMASHOT)
					if (PIOS_DMAShot_IsConfigured() && PIOS_DMAShot_RegisterServo(chan)) {
						output_channels[j].mode = SYNC_DSHOT_DMA;
					} else {
						ChannelSetup_DShot(j, rate);
					}
#else
						ChannelSetup_DShot(j, rate);
#endif
					break;
				case SHOT_ONESHOT:
					output_channels[j].i.pwm_res = timer_banks[i].clk_rate;
					output_channels[j].mode = SYNC_PWM;
					break;
				default:
					output_channels[j].i.pwm_res = timer_banks[i].clk_rate;
					if (channel_max[j] >= channel_min[j]) {
						output_channels[j].mode = REGULAR_PWM;
					} else {
						output_channels[j].mode = REGULAR_INVERTED_PWM;
					}
					break;
				}
			}
		}
	}

#if defined (PIOS_INCLUDE_DMASHOT)
	if (PIOS_DMAShot_IsConfigured()) {
		PIOS_DMAShot_Validate();
		PIOS_DMAShot_InitializeGPIOs();
		PIOS_DMAShot_InitializeTimers((TIM_OCInitTypeDef *)&servo_cfg->tim_oc_init);
		PIOS_DMAShot_InitializeDMAs();
	}
#endif

