d-ronin/dRonin/flight/PiOS/STM32/pios_servo.c
	return 0;
}

static void PIOS_Servo_SetRaw(uint8_t servo, uint32_t raw_position) {
	const struct pios_tim_channel *chan = &servo_cfg->channels[servo];

	// in one-pulse mode, the pulse length is ARR - CCR
	if (output_channels[servo].mode == SYNC_PWM) {
		raw_position = chan->timer->ARR - raw_position;
	}

	/* Update the raw_position */
	switch(chan->timer_chan) {
		case TIM_Channel_1:
			TIM_SetCompare1(chan->timer, raw_position);
			break;
		case TIM_Channel_2:
			TIM_SetCompare2(chan->timer, raw_position);
			break;
		case TIM_Channel_3:
			TIM_SetCompare3(chan->timer, raw_position);
			break;
		case TIM_Channel_4:
			TIM_SetCompare4(chan->timer, raw_position);
			break;
	}
}

// Fraction: 0.16
// max_val, min_val: microseconds (seconds * 1000000)
void PIOS_Servo_SetFraction(uint8_t servo, uint16_t fraction,
		uint16_t max_val, uint16_t min_val)
{
	PIOS_Assert(max_val >= min_val);

	/* Make sure servo exists */
	if (!servo_cfg || servo >= servo_cfg->num_channels ||
			output_channels[servo].mode == UNCONFIGURED) {
		return;
	}

	switch (output_channels[servo].mode) {
		case SYNC_DSHOT_300:
		case SYNC_DSHOT_600:
		case SYNC_DSHOT_1200:
			/* Expect a 0 to 2047 range!
			 * Don't bother with min/max tomfoolery here.
			 */
			output_channels[servo].i.dshot.value = fraction >> 5;
			return;
		case SYNC_DSHOT_DMA:
#if defined(PIOS_INCLUDE_DMASHOT)
			if (PIOS_DMAShot_IsConfigured()) {
				PIOS_DMAShot_WriteValue(&servo_cfg->channels[servo], fraction >> 5);
			}
#endif
			return;
		default:
			break;
	};

	// Seconds * 1000000 : 16.0
	uint16_t spread = max_val - min_val;

	uint64_t val = min_val;
	val = val << 16;
	// Seconds * 1000000 : 16.16

	val += spread * fraction;

	// Multiply by ticks/second to get: Ticks * 1000000: 36.16
	val *= output_channels[servo].i.pwm_res;

	// Ticks: 16.16
	val /= 1000000;

	// Round to nearest, 16.0
	val += 32767;
	val = val >> 16;

	if (resetting && (fraction < 0xff00)) {
		/* If we're resetting and the value isn't driven to the maximum
		 * value, drive low with no pulses.  If it's at the max value,
		 * it could be driving brushed motors and forced low is bad.
		 */
		val = 0;
	}

	PIOS_Servo_SetRaw(servo, val);
}

/**
* Set servo position
* \param[in] Servo Servo number (0->num_channels-1)
* \param[in] Position Servo position in microseconds
*/
void PIOS_Servo_Set(uint8_t servo, float position)
{
	/* Make sure servo exists */
	if (!servo_cfg || servo >= servo_cfg->num_channels ||
			output_channels[servo].mode == UNCONFIGURED) {
		return;
	}

	switch (output_channels[servo].mode) {
		case SYNC_DSHOT_300:
		case SYNC_DSHOT_600:
		case SYNC_DSHOT_1200:
			if (position > 2047)
				position = 2047;
			else if (position < 0)
				position = 0;

			output_channels[servo].i.dshot.value = position;
			return;
		case SYNC_DSHOT_DMA:
#if defined(PIOS_INCLUDE_DMASHOT)
			if (PIOS_DMAShot_IsConfigured()) {
				if (position > 2047)
					position = 2047;
				else if (position < 0)
					position = 0;

				PIOS_DMAShot_WriteValue(&servo_cfg->channels[servo], position);
			}
#endif
			return;
		default:
			break;
	};


	/* recalculate the position value based on timer clock rate */
	/* position is in us. */
	float us_to_count = output_channels[servo].i.pwm_res / 1000000.0f;
	position = position * us_to_count;

	if (resetting && (output_channels[servo].mode != REGULAR_INVERTED_PWM)) {
		/* Don't nail inverted channels low during reset, because they
		 * could be driving brushed motors.
		 */
		position = 0;
	}

	PIOS_Servo_SetRaw(servo, position);
}

#ifdef STM32F0XX	// No high-res delay on F0 yet
static int DSHOT_Update()
{
	return -1;
}
#else
static int DSHOT_Update()
{
	uint16_t dshot_bits[DS_GPIO_NUMVALS] = { 0 };
	uint16_t dshot_msg_zeroes[16][DS_GPIO_NUMVALS] = { { 0 } };

	enum channel_mode dshot_mode = UNCONFIGURED;

	for (int i = 0; i < servo_cfg->num_channels; i++) {
		struct output_channel *chan = &output_channels[i];

		switch (chan->mode) {
			case SYNC_DSHOT_300:
			case SYNC_DSHOT_600:
			case SYNC_DSHOT_1200:
				break;
			default:
				continue;	// Continue enclosing loop if not ds
		}

		if (dshot_mode == UNCONFIGURED) {
			dshot_mode = chan->mode;
		} else if (dshot_mode != chan->mode) {
			/* Multiple dshot rates not supported */
			return -1;
		}

		struct dshot_info *info = &chan->i.dshot;

		PIOS_Assert(info->gpio >= 0);
		PIOS_Assert(info->gpio < DS_GPIO_NUMVALS);

		dshot_bits[info->gpio] |= info->pin;

		PIOS_Assert(info->value < 2048);

		uint16_t message = info->value << 5;
		/* Don't set telem req bit for now */

		message |= 
			((message >> 4 ) & 0xf) ^
			((message >> 8 ) & 0xf) ^
			((message >> 12) & 0xf);

		for (int j = 0; j < 16; j++) {
			if (! (message & 0x8000)) {
				dshot_msg_zeroes[j][info->gpio] |= info->pin;
			}

			message <<= 1;
		}

		info->value = 0;	/* turn off motor if not updated */
	}

	uint16_t time_0, time_1, time_tot;

	/* As specified by original document:
	 * DShot 300 - 1250ns 0, 2500ns 1, 3333ns total
	 * DShot 600 -  625ns 0, 1250ns 1, 1667ns total
	 * DShot 1200-  312ns 0,  625ns 1,  833ns total
	 *
	 * Below timings are as used by Betaflight, which blheli_s seems to
	 * demand.  Meh.
	 * DShot 300 - 1000ns 0, 2166ns 1, 3333ns total
	 * DShot 600 -  500ns 0, 1083ns 1, 1667ns total
	 * DShot 1200-  250ns 0,  541ns 1,  833ns total
	 */

	switch (dshot_mode) {
		case UNCONFIGURED:
			return -1;
		case SYNC_DSHOT_300:
			time_0   = PIOS_INLINEDELAY_NsToCycles(1000);
			time_1   = PIOS_INLINEDELAY_NsToCycles(2166);
			time_tot = PIOS_INLINEDELAY_NsToCycles(3333);
			break;
		case SYNC_DSHOT_600:
			time_0   = PIOS_INLINEDELAY_NsToCycles(500);
			time_1   = PIOS_INLINEDELAY_NsToCycles(1083);
			time_tot = PIOS_INLINEDELAY_NsToCycles(1667);
			break;
		case SYNC_DSHOT_1200:
			time_0   = PIOS_INLINEDELAY_NsToCycles(250);
			time_1   = PIOS_INLINEDELAY_NsToCycles(541);
			time_tot = PIOS_INLINEDELAY_NsToCycles(833);
			break;
		default:
			PIOS_Assert(0);
			break;
	}

	if (dshot_mode == UNCONFIGURED) {
		return -1;
	}

	PIOS_IRQ_Disable();	// Necessary for critical timing below

	register uint16_t a = dshot_bits[DS_GPIOA];
	register uint16_t b = dshot_bits[DS_GPIOB];
	register uint16_t c = dshot_bits[DS_GPIOC];

	uint32_t start_cycle = PIOS_INLINEDELAY_GetCycleCnt() + 30;

	/* Time to get down to business of bitbanging this out. */
	for (int i = 0; i < 16; i++) {
		// Always delay at the beginning for consistent timing
		PIOS_INLINEDELAY_TillCycleCnt(start_cycle);

#if defined(STM32F40_41xxx) || defined(STM32F446xx)
#define CLEAR_BITS(gpio, bits) do { (gpio)->BSRRH = bits; } while (0)
#define SET_BITS(gpio, bits) do { (gpio)->BSRRL = bits; } while (0)
#else
		// Many STM32F* do not allow halfword writes to BSRR (or have
		// BSRRL/H definitions), so do it this way:

